Show / Hide Table of Contents
Class Polygon3D
Represents a polygon in three-dimensional space.
Inheritance
System.Object
OpenObject
Polygon3D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.Polygon3D,CI.Geometry3D")]
public class Polygon3D : OpenObject
Constructors
Improve this Doc   View Source
Polygon3D()
Contructor
Declaration
public Polygon3D()
Properties
Improve this Doc   View Source
Points
List of polygon points
Declaration
public List<Point3D> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point3D>
 Improve this Doc
 View Source